### Rose Tovar
### RoseATovar@gmail.com
### MySQL Database Set up Work

In [1]:
import pandas as pd
import numpy as np
import json, os
from sqlalchemy_utils import create_database, database_exists
import pymysql
from sqlalchemy import create_engine
from sqlalchemy.types import *

### Create Tables for database

In [2]:
## Import Data

In [3]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118.0,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70.0,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122.0,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100.0,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126.0,Drama

In [4]:
# splitting genre list on comma
genre_list = basics['genres'].str.split(',')
genre_list

0           [Comedy, Fantasy, Romance]
1                              [Drama]
2                              [Drama]
3             [Comedy, Horror, Sci-Fi]
4                              [Drama]
                     ...
92066         [Comedy, Drama, Fantasy]
92067                          [Drama]
92068    [Action, Adventure, Thriller]
92069                 [Drama, History]
92070        [Adventure, History, War]
Name: genres, Length: 92071, dtype: object

In [5]:
# Exploading them to get each genre from each movie
exploed_genres = genre_list.explode()
exploed_genres.head()

0     Comedy
0    Fantasy
0    Romance
1      Drama
2      Drama
Name: genres, dtype: object

In [6]:
# Saving Unique Values
unique_genres = exploed_genres.dropna().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Mystery', 'Thriller', 'Musical', 'Action', 'Adventure', 'Crime',
       'Music', 'Animation', 'Family', 'War', 'History', 'Biography',
       'Adult', 'Sport', 'Western', 'Short', 'Reality-TV', 'Talk-Show',
       'News', 'Game-Show'], dtype=object)

In [7]:
int_ids = list(range(len(unique_genres)))
int_ids[:5]

[0, 1, 2, 3, 4]

In [8]:
# Creating a map with a genre with an id
genre_map = dict(zip(unique_genres, int_ids))
genre_map

{'Comedy': 0,
 'Fantasy': 1,
 'Romance': 2,
 'Drama': 3,
 'Horror': 4,
 'Sci-Fi': 5,
 'Mystery': 6,
 'Thriller': 7,
 'Musical': 8,
 'Action': 9,
 'Adventure': 10,
 'Crime': 11,
 'Music': 12,
 'Animation': 13,
 'Family': 14,
 'War': 15,
 'History': 16,
 'Biography': 17,
 'Adult': 18,
 'Sport': 19,
 'Western': 20,
 'Short': 21,
 'Reality-TV': 22,
 'Talk-Show': 23,
 'News': 24,
 'Game-Show': 25}

In [9]:
# Creating a genre look up table
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                         'genre_id':genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Comedy         0
1    Fantasy         1
2    Romance         2
3      Drama         3
4     Horror         4

In [10]:
## Create a table for a movie having a genre
movie_genre = pd.DataFrame(columns=['tconst', 'genre_id'])
movie_genre

Empty DataFrame
Columns: [tconst, genre_id]
Index: []

In [11]:
# this code loops through the basics and genre index to populate a table with the tconst 
# and genre id
num = 0
for index in range(len(basics)):
    for genre_index in range(len(genre_lookup)):
        if genre_lookup.loc[genre_index, 'genre_name'] in basics.loc[index, "genres"]:
            tconst = basics.loc[index, 'tconst']
            genre_id = genre_lookup.loc[genre_index,'genre_id']
            movie_genre.loc[num] = [tconst, genre_id]
            num += 1

In [12]:
movie_genre.head()

      tconst  genre_id
0  tt0035423         0
1  tt0035423         1
2  tt0035423         2
3  tt0062336         3
4  tt0069049         3

In [13]:
basics.drop(columns=['genres', 'isAdult','titleType','originalTitle', 'endYear'], inplace=True)
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118.0
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70.0
2,tt0069049,The Other Side of the Wind,2018,122.0
3,tt0088751,The Naked Monster,2005,100.0
4,tt0096056,Crime and Punishment,2002,126.0

In [14]:
genre_lookup.to_csv('Data/genre_lookup.csv.gz', compression='gzip',index=False)
movie_genre.to_csv('Data/movie_genre.csv.gz', compression='gzip', index=False)
basics.to_csv('Data/updated_basics.csv.gz', compression='gzip', index=False)

In [15]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
new_tmdb = tmdb[['imdb_id','budget', 'revenue','certifcation']]
new_tmdb.head()

     imdb_id      budget     revenue certifcation
0  tt0113026  10000000.0         0.0          NaN
1  tt0113092         0.0         0.0          NaN
2  tt0116391         0.0         0.0          NaN
3  tt0118694    150000.0  12854953.0           PG
4  tt0118852         0.0         0.0            R

In [16]:
new_tmdb.to_csv(f"Data/updated_tmdb.csv.gz", compression="gzip", index=False)

### Load in Rating Data

In [17]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256
2  tt0000003            6.5      1715
3  tt0000004            5.6       169
4  tt0000005            6.2      2529

### Creating Database

In [18]:
with open('/home/vanica/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['uname', 'pwd'])

In [19]:
conn = f"mysql+pymysql://{login['uname']}:{login['pwd']}@localhost/movies"

engine = create_engine(conn)

In [20]:
# checking if database exist
if database_exists(conn) == False:
    create_database(conn)
else:
    print('Database already exist')

Database already exist

### Creating tables

In [21]:
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
cert_len = tmdb['certifcation'].fillna('').map(len).max()

# basics Schema for database
basics_schema = {
    'tconst': String(key_len+1),
    "primaryTitle": Text(title_len+1),
    'startYear': Float(),
    'runTimeMinutes': Integer()
}


# ratings schema for database
ratings_schema ={
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'numVotes': Integer()
}


# tmdb schema for database
tmdb_schema ={
    'imdb_id': String(key_len+1),
    "budget": Float(),
    'revenue': Float(),
    'certifcation': String(cert_len+1)
}

In [22]:
# creating database tables, apply schema

basics.to_sql('title_basics', engine, dtype=basics_schema,if_exists='replace', index=False)
ratings.to_sql('title_ratings', engine, dtype=ratings_schema,  if_exists='replace', index=False)
movie_genre.to_sql('title_genres', engine, if_exists='replace', index=False)
genre_lookup.to_sql('genres', engine, if_exists='replace', index=False)
new_tmdb.to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists='replace', index=False)

2572

In [23]:
engine.execute('ALTER TABLE movies.title_basics ADD PRIMARY KEY (`tconst`);')

In [24]:
engine.execute('ALTER TABLE movies.title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE movies.genres ADD PRIMARY KEY (`genre_id`);')
engine.execute('ALTER TABLE movies.tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [25]:
q="""
SELECT * FROM title_basics LIMIT 5
"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118.0
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70.0
2,tt0069049,The Other Side of the Wind,2018.0,122.0
3,tt0088751,The Naked Monster,2005.0,100.0
4,tt0096056,Crime and Punishment,2002.0,126.0

In [26]:
q="""
SELECT * FROM title_ratings LIMIT 5
"""

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1910
1  tt0000002            5.8       256
2  tt0000003            6.5      1715
3  tt0000004            5.6       169
4  tt0000005            6.2      2529

In [27]:
q="""
SELECT * FROM title_genres LIMIT 5
"""

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         0
1  tt0035423         1
2  tt0035423         2
3  tt0062336         3
4  tt0069049         3

In [28]:
q="""
SELECT * FROM genres LIMIT 5
"""

pd.read_sql(q, engine)

  genre_name  genre_id
0     Comedy         0
1    Fantasy         1
2    Romance         2
3      Drama         3
4     Horror         4

In [29]:
q="""
SELECT * FROM tmdb_data LIMIT 5
"""

pd.read_sql(q, engine)

     imdb_id      budget     revenue certifcation
0  tt0035423  48000000.0  76019000.0        PG-13
1  tt0113026  10000000.0         0.0         None
2  tt0113092         0.0         0.0         None
3  tt0114447         0.0         0.0         None
4  tt0116391         0.0         0.0         None

In [30]:
q="""
SHOW TABLES
"""

pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data